szf2020/IoTZoo/Esp32Client/Microcontroller/src/main.cpp
#ifdef USE_AUDIO_STREAMER
    if (nullptr != audioStreamer)
    {
        audioStreamer->onMqttConnectionEstablished();
    }
#endif

#ifdef USE_GPS
    if (nullptr != gps)
    {
        gps->onMqttConnectionEstablished();
    }
#endif

#ifdef USE_BUZZER
    if (nullptr != buzzer)
    {
        buzzer->onMqttConnectionEstablished();
    }
#endif

#ifdef USE_TM1637_4
    if (nullptr != tm1637_4Handling)
    {
        tm1637_4Handling->onMqttConnectionEstablished(mqttClient, getBaseTopic());
    }
#endif

#ifdef USE_TM1637_6
    tm1637_6Handling.onMqttConnectionEstablished(settings, mqttClient, getBaseTopic());
#endif

#ifdef USE_LED_AND_KEY
    if (nullptr != tm1638)
    {
        tm1638->onMqttConnectionEstablished();
    }
#endif

#ifdef USE_HT1621
    if (nullptr != ht1621)
    {
        ht1621->onMqttConnectionEstablished();
    }
#endif // USE_HT1621

#ifdef USE_MAX7219
    if (nullptr != max7219)
    {
        max7219->onMqttConnectionEstablished();
    }
#endif // USE_MAX7219

#ifdef USE_REMOTE_GPIOS
    for (auto& remoteGpio : remoteGpios)
    {
        remoteGpio.onMqttConnectionEstablished();
    }
#endif // USE_REMOTE_GPIOS

#ifdef USE_TRAFFIC_LIGHT_LEDS
    for (auto& trafficLight : trafficLightLeds)
    {
        trafficLight.onMqttConnectionEstablished();
    }
#endif

    String topicReboot = getBaseTopic() + "/system";

    mqttClient->subscribe(topicReboot,
                          [&](const String& payload)
                          {
                              if (payload == "reboot")
                              {
                                  restart();
                              }
                          });

    String topicIntervalAlive = getBaseTopic() + "/alive_config";
    mqttClient->subscribe(topicIntervalAlive,
                          [&](const String& json)
                          {
                              StaticJsonDocument<256> jsonDocument;
                              if (!deserializeStaticJsonAndPublishError(jsonDocument, json))
                              {
                                  return;
                              }

                              String key = jsonDocument["key"].as<String>();

                              unsigned long aliveIntervalMs    = jsonDocument["aliveIntervalMs"];
                              bool          aliveAckLedEnabled = jsonDocument["aliveAckLedEnabled"];

                              settings->setAliveIntervalMillis(aliveIntervalMs);
                              Serial.println("aliveIntervalMs: " + String(settings->getAliveIntervalMillis()));

                              settings->setAliveLedEnabled(aliveAckLedEnabled);
                              Serial.println("aliveAckLedEnabled " + String(settings->isAliveAckLedEnabled()));
                          });

    // Save the device configurations.
    String topicSetDeviceConfiguration = getBaseTopic() + "/save_device_config";
    mqttClient->subscribe(topicSetDeviceConfiguration,
                          [&](const String& payload)
                          {
                              Serial.println("Received device configurations -> Save it.");
                              onReceivedConnectedDevicesConfiguration(payload);
                              restart();
                          });

    String topicSaveConfiguration = getBaseTopic() + "/settings/save";
    mqttClient->subscribe(topicSaveConfiguration,
                          [&](const String& json)
                          {
                              try
                              {
                                  Serial.print("Received configuration data -> Save it. ");

                                  StaticJsonDocument<4096> jsonDocument;
                                  if (!deserializeStaticJsonAndPublishError(jsonDocument, json))
                                  {
                                      return;
                                  }

                                  String key  = jsonDocument["key"].as<String>();
                                  String data = jsonDocument["data"].as<String>();
                                  Serial.println("key:" + key + ", date: " + data);
                                  settings->saveConfigurationData(key, data);
                              }
                              catch (const std::exception& e)
                              {
                                  publishError(String(e.what()));
                              }
                          });

    String topicLoadConfiguration = getBaseTopic() + "/settings/load";
    mqttClient->subscribe(topicLoadConfiguration, onLoadAndPublishConfigurationByKey);

    // Save the project configurations.
    String topicSetMicrocontrollerConfiguration = macAddress + "/save_microcontroller_config"; // macAddress instead of getBaseTopic()!
    mqttClient->subscribe(topicSetMicrocontrollerConfiguration,
                          [&](const String& payload)
                          {
                              if (payload.length())
                              {
                                  Serial.println("Received topic + " + topicSetMicrocontrollerConfiguration +
                                                 " -> save the microcontroller configuration.");
                                  if (onReceivedMicrocontrollerConfiguration(payload))
                                  {
                                      // Remove retained message from the server
                                      mqttClient->removeRetainedMessageFromBroker(topicSetMicrocontrollerConfiguration);
                                      restart();
                                  }
                              }
                          });
}

#endif

/**
 * @brief Loads the configuration for the connected devices and instantiates them.
 */
void makeInstanceConfiguredDevices()
{
    Serial.println("Loading device configurations and instantiate devices...");

    String jsonDeviceConfigurations = settings->loadDeviceConfigurations();
    if (0 == jsonDeviceConfigurations.length())
    {
        Serial.println("Not yet configured!");
    }
    else // if (jsonDeviceConfigurations.length() > 0)
    {
        Serial.println("Config: " + jsonDeviceConfigurations);
        DynamicJsonDocument jsonDocument(4096);

        if (!deserializeStaticJsonAndPublishError(jsonDocument, jsonDeviceConfigurations))
        {
            return;
        }

        JsonArray arrDevices = jsonDocument.as<JsonArray>();

        for (JsonVariant value : arrDevices)
        {
            String deviceType  = value["DeviceType"];
            int    deviceIndex = value["DeviceIndex"];
            bool   isEnabled   = value["IsEnabled"];

            Serial.println("DeviceName: '" + deviceType + "', IsEnabled: " + String(isEnabled));

            if (isEnabled)
            {
                JsonArray arrPins       = value["Pins"].as<JsonArray>();
                JsonArray arrProperties = value["PropertyValues"].as<JsonArray>();

#ifdef USE_BUTTON
                if (deviceType == "Button")
                {
                    int buttonPin = arrPins[0]["MicrocontrollerGpoPin"];

                    buttonHandling.addDevice(deviceIndex, settings, mqttClient, getBaseTopic(), buttonPin);

                    Serial.println("Button initialized.");
                }
#endif // USE_BUTTON

